<template>
  <div id="model1" class="model">
    <div class="model_bg"></div>
    <div class="model-wrapper">
      <div class="model_close"></div>
      <div class="model-head">応募要項</div>
      <div class="textarea" v-html="message" />
    </div>
  </div>
</template>
<script>
/* eslin-disable */
export default {
  data() {
    return {
      text: `
特別区競馬組合（以下、「本組合」といいます）が主催する「TCK重賞勝利ジョッキーを当てろ！キャンペーン～勝つのは、誰だ？～」（以下、「本キャンペーン」といいます）にご応募いただく前に、本応募要項をよくお読みいただき、同意の上ご応募ください。
本キャンペーンに応募される場合は、下記応募要項に同意したものとみなします。ご同意いただけない場合は、
大変申し訳ありませんが応募はご遠慮ください。

１．キャンペーン名
TCK重賞勝利ジョッキーを当てろ！キャンペーン～勝つのは、誰だ？～

２．応募期間各対象レースの発走５分前まで
※対象レースは公式サイトのスケジュールをご覧ください。
URL：https://www.tck2022-jockey-cp.com/

３．応募方法
(1)パソコン、スマートフォンからTCK公式Twitterアカウント(@tck_keiba)をフォローしてください。
(2)大井競馬場で行われる重賞競走（一部を除く）の前に投稿されるキャンペーンツイートに対し、「#〇〇」（〇〇には対象のレース名）、「＃△△」（△△には予想する勝利騎手の名前:フルネーム）、「＃TCK重賞勝利ジョッキーを当てろ」の３つのハッシュタグを付けて、引用リツイートしてください。
(3)予想が的中した方の中から抽選で賞品をプレゼントいたします。
※当選賞品は選べません。

４．応募条件
●以下の①から⑤までのすべてを満たす方であり、かつ、必ず第８項の注意事項および第９項の禁止事項に該当しないことを確認のうえご応募ください。
①日本国内にお住まいの20歳以上の方。
②本応募要項すべてに同意していただいた方。
※本キャンペーンへの応募をもって、本応募要項すべてに同意いただいたものとみなします。万が一、同意いただけない場合は本キャンペーンへの応募はご遠慮ください。
③Twitterのアカウントをお持ちで、公開設定にしている方。
※Twitterアカウントを非公開にしている場合、ツイートを確認することができないため、本キャンペーンには参加できません。
④TCK公式Twitterアカウント(@tck_keiba)をフォローしている方で、キャンペーン期間中に対象のツイートに３つの指定ハッシュタグを付けて、引用リツイートした方。
⑤Twitterアカウントをお持ちでない方は下記サイトより新規登録をしていただければ応募できます。
https://twitter.com（外部サイトへリンクします）

５．賞品
●勝利ジョッキーサイン入りゴーグル　5名様(各レース)
●QUOカード　500円分　50名様(各レース)
 
６．抽選方法
対象レースの勝利騎手予想を的中させた方の中からの抽選となります。

７．当選者の発表と賞品発送
(1)応募条件を全て満たした応募者の中から厳正な抽選のうえ、当選者に対してのみTCK公式アカウントよりTwitterのダイレクトメッセージにて当選のご連絡をいたします。メッセージ内の当選者専用フォームに必要事項を記載の上、メッセージ内に記載された期日までにご登録ください。当該期日までに入力がない場合、当選を無効とさせていただきます。
(2)当選者専用フォームに必要事項をご登録後、ご入力頂いたEメールアドレスにご入力完了のご連絡をお送りさせて頂きます。
(3)当選者へのご連絡は、対象レースが行われる大井競馬開催週最終日から約2週間程度でおこないます。
(4)抽選の結果等についてのお問い合わせにはお答えできませんのであらかじめご了承ください。
(5)賞品内容や当選人数などは、変更される場合があります。
(6)次の①から⑩のいずれかの場合は、当選を無効とさせていただく場合がございますのでご注意ください。なお、当選無効が発生した場合、当選人数は第５項記載の数に達しないことがあります。

①当選までに Twitterのアカウントを削除された場合
②TCK公式アカウント「@tck_keiba」をフォローしていない場合
③不正なアカウント(架空アカウント、他人のなりすましアカウント、同一人物による複数アカウントなど)を利用して応募があった場合（Twitterの利用規約に反する場合を含む）
④プログラムによる大量投稿等の不正な行為、その他法令もしくは公序良俗に違反する行為があると判断した場合
⑤ウィルス等の有害なコンピュータープログラム等を送信または掲載する行為があったと判断した場合
⑥応募者が、過去、現在かつ将来にわたり、暴力団等の反社会的勢力に該当した場合
⑦応募者が、暴力的要求行為または反社会的行為を行った場合
⑧キャンペーンの当選権利を他人に譲渡・転売した場合又は換金した場合
⑨ダイレクトメッセージを受信拒否設定している場合
⑩その他、応募に際して不正な行為があった場合

８．注意事項
(1)ご応募は対象レースごとにおひとり様1回の応募に限らせていただきます。
(2)Twitterの同一アカウントから、同一の対象レースに２回以上の応募が行われた場合、１回の応募のみを有効として扱い、その他の応募は無効とさせていただきます。
(3)本キャンペーン応募後、レース発走5分前までに対象レースの出走馬に出走取消や競走除外、騎手に乗り替わりが発生した場合、応募した内容を取り消した上で再度応募（変更）する事を可能といたします。
(4)天候不良などにより対象レースが中止となった場合、当該日の本キャンペーンも中止とさせていただきます。対象レースが延期となった場合も、本キャンペーンは中止とさせていただきます。
(5)キャンペーンの途中でTwitterアカウントを変更された場合、変更前のキャンペーン結果との照合はできませんのでご注意ください。
(6)本キャンペーン対象レースの１着が同着になった場合、予想が的中した方全員から抽選を行います。
(7)本キャンペーン対象レースの着順が後日変更となった場合でも、着順確定時のレース結果に基づいて抽選を行います。
(8)ご応募の際には、位置情報共有機能をオフにすることを推奨いたします。
(9)本キャンペーンへの応募は無料ですが、インターネット通信料・接続料は応募者様負担となります。
(10)通信の際の接続トラブルについては、責任を負いかねますので、あらかじめご了承ください。
(11)お使いのスマートフォンの機種・設定・使用状況・通信環境などの理由により、応募できない場合がありますので、ご注意ください。
(12)スマートフォンの設定などに関するお問い合わせは、携帯電話各社または製造元のメーカーにお問い合わせください。本組合では、原則、回答しかねます。
(13)本キャンペーンにて投稿いただいた内容について、本組合の広報・宣伝活動において、本組合のウェブサイトや各種SNS、パンフレットその他宣伝広告物に掲載させていただくことがございます。掲載にあたっては、応募者への事前告知はなく、応募者に対する投稿作品の掲載・使用料は発生いたしません。あらかじめご了承ください。
(14)本組合の職員および関係者は応募できません。
(15)本キャンペーンはTwitter社とは関係ありません。
(16)本キャンペーンは予告なく終了する場合がございます。
(17)応募者は、本キャンペーンの応募にあたり、注意事項及び事務局の運営方法に従うものとし、その運営方法について一切異議を申し立てないものとします。
(18)本応募規約に関しては、日本法を準拠法とし、本応募規約に関する紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。

９．禁止事項
本キャンペーンへの応募に際し、以下の行為を禁止します。投稿者が下記に該当する行為を行ったと判断した場合は、無効とします。
①本応募要項に違反する行為
②本キャンペーンの運営を妨げる行為
③本キャンペーンの賞品をオークションに出品する等の転売行為
④虚偽の情報の提供
⑤他人に迷惑、不利益、損害または不快感を与える行為
⑥他人を誹謗中傷し、またはその名誉若しくは信用を毀損する行為
⑦他人の著作権その他の知的財産権を侵害する行為
⑧他人の財産、プライバシー若しくは肖像権を侵害する行為
⑨わいせつ、児童ポルノ及び児童の性的搾取を助長する行為
⑩営利を目的とした情報提供、広告宣伝もしくは勧誘行為
⑪法令に違反する行為
⑫公序良俗に反する行為
⑬Twitterの利用規約に違反する行為
⑭その他、前各号に類する行為

10．免責事項
(1)本組合は、本サイト(https://www.tck2022-jockey-cp.com/)に瑕疵がないこと、本サイトの機能が障害なく稼働すること、本サイトが中断・停止しないことについていかなる保証も行いません。
(2)本組合は、他のご利用者による本応募要項への違反行為に関して一切責任を負いません。また、ご利用者間またはご利用者と第三者間のトラブル、紛争について本組合は一切関与いたしません。ご利用者の責任と費用において解決するものとします。
(3)本組合は、本サイトの完全性、正確性、確実性、有用性、合目的性について、いかなる保証も行いません。
(4)本組合は、ご利用者が本サイトを利用したこと、または利用できなかったことによって発生した損害、損失、不利益等に対し、一切責任を負いません。
 
11．本サイト、本キャンペーン及び応募要項の停止・変更・廃止
(1)本組合は自らの判断により、いつでも本サイト又は本キャンペーンの全部または一部の提供の中断・停止を行い、本サイト又は本キャンペーンの全部または一部の内容を変更し、本サイト又は本キャンペーンを永続的に廃止することができるものとします。
(2)本組合は必要と認めた場合、いつでも本応募要項の内容を変更することができるものとします。ただし、本応募要項の変更が投稿者又はご利用者に多大な影響を与えると本組合が判断した場合、合理的な予告期間を設けます。
(3)本応募要項を変更した場合、投稿者又はご利用者が本応募要項の変更前に投稿・入力された本件素材につきましても、変更後の要項が適用されます。
(4) 本組合は、本組合の故意または重過失によるものを除き、本キャンペーンの変更、中断、中止、終了等に関して一切の責任を負わないものとします。
 
12．推奨環境
【スマートフォン】
iOS 9.0以降　Safari最新及びTwitterAppがインストールされていること
Android 4.1以降　Chrome最新及びTwitterAppがインストールされていること
【PC】
Windows 8、Windows10　Edge最新、Chrome最新
Mac OS10.10以降　Safari最新、Chrome最新

13．個人情報の取扱い
ご応募いただいた際のアカウント情報等は、本組合が、賞品発送および発送連絡の他、投稿者サービスの向上及び個人を特定しない統計資料の作成の目的で利用させていただきます。また、その情報を、投稿者の同意を得ないで業務委託先以外の第三者に開示・提供することはありません。（法令により開示・提供を認められた場合を除きます。）
個人情報の考え方に関しましては、東京シティ競馬ホームページ内「個人情報について」に記載されております。
https://www.tokyocitykeiba.com/legal/
 
14．お問い合わせ
勝利ジョッキー予想キャンペーン事務局
メールアドレス　info@tck2022-jockey-cp.com
開設期間　2022年4月18日(水)～2023年3月31日(金)
対応時間　10：00～17：00　※土・日・祝日・年末年始を除く
※受付時間外の場合や質問内容によって、ご返答にお日にちを要する場合がありますので、予めご了承ください。
※お問い合わせの際は、事務局からの連絡メールを受け取るために、
「@tck2022-jockey-cp.com」からのメールを受信できるよう設定してください。
      `,
    }
  },
  computed: {
    message() {
      return this.text.replace(/\n/g, '<br>')
    },
  },
  mounted() {
    /* eslint-disable no-undef */
    const model = $('.model')
    const modelBg = $('.model_bg')
    const modelClose = $('.model_close')

    modelBg.on('click', () => {
      model.fadeOut()
      $('body').removeAttr('style')
    })
    modelClose.on('click', () => {
      model.fadeOut()
      $('body').removeAttr('style')
    })
  },
}
</script>

<style lang="postcss">
.model {
  position: fixed;
  top: 0;
  left: 0;
  width: 100vw;
  height: 100vh;
  z-index: 2000;
  display: none;
}
.model_bg {
  position: absolute;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.8);
  z-index: 0;
}
.model-wrapper {
  position: absolute;
  top: 50%;
  left: 50%;
  transform: translate(-50%, -50%);
  width: 80%;
  max-width: 960px;
  background-color: #fff;
  @media (--sp) {
    width: 90%;
  }
}
.model_close {
  position: absolute;
  top: 10px;
  right: 10px;
  width: 30px;
  height: 30px;
  transition: 0.4s ease-in-out;
  cursor: pointer;

  &::before {
    content: '';
    position: absolute;
    top: 15px;
    left: 0;
    width: 30px;
    height: 2px;
    transform: rotate(45deg);
    transform-origin: center;
    background-color: #d70c19;
  }
  &::after {
    content: '';
    position: absolute;
    top: 15px;
    left: 0;
    width: 30px;
    height: 2px;
    transform: rotate(-45deg);
    transform-origin: center;
    background-color: #d70c19;
  }
}
.model-head {
  padding: 5% 0;
  text-align: center;
  font-size: 24px;
  font-weight: bold;
  @media (--sp) {
    font-size: 16px;
  }
}
textarea {
  width: 100%;
  border: none;
  padding: 0 5% 5%;
  height: 60vh;
  resize: none;
  outline: none;
  font-size: 14px;
  @media (--sp) {
    font-size: 12px;
  }
}
.textarea {
  width: 100%;
  border: none;
  padding: 0 5% 5%;
  height: 60vh;
  resize: none;
  outline: none;
  font-size: 14px;
  overflow-y: auto;
  line-height: 1.1;
  @media (--sp) {
    font-size: 12px;
  }
}
</style>
